{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "58cacf1d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hello World\n"
     ]
    }
   ],
   "source": [
    "print(\"Hello World\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ba3a9734",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "John\n",
      "{'labels_added': 1, 'labels_removed': 0, 'nodes_created': 1, 'nodes_deleted': 0, 'properties_set': 0, 'relationships_created': 0, 'relationships_deleted': 0}\n",
      "John\n",
      "MATCH (u:User {name: $name}) RETURN u.name AS name\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    " \n",
    "# Define correct URI and AUTH arguments (no AUTH by default)\n",
    "URI = \"bolt://localhost:7687\"\n",
    "AUTH = (\"\", \"\")\n",
    " \n",
    "with GraphDatabase.driver(URI, auth=AUTH) as client:\n",
    "    # Check the connection\n",
    "    client.verify_connectivity()\n",
    " \n",
    "    # Create a user in the database\n",
    "    records, summary, keys = client.execute_query(\n",
    "        \"CREATE (u:User {name: $name, password: $password}) RETURN u.name AS name;\",\n",
    "        name=\"John\",\n",
    "        password=\"pass\",\n",
    "        database_=\"memgraph\",\n",
    "    )\n",
    " \n",
    "    # Get the result\n",
    "    for record in records:\n",
    "        print(record[\"name\"])\n",
    " \n",
    "    # Print the query counters\n",
    "    print(summary.counters)\n",
    " \n",
    "    # Find a user John in the database\n",
    "    records, summary, keys = client.execute_query(\n",
    "        \"MATCH (u:User {name: $name}) RETURN u.name AS name\",\n",
    "        name=\"John\",\n",
    "        database_=\"memgraph\",\n",
    "    )\n",
    " \n",
    "    # Get the result\n",
    "    for record in records:\n",
    "        print(record[\"name\"])\n",
    " \n",
    "    # Print the query\n",
    "    print(summary.query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6e05330f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node 5: Hello, World!\n"
     ]
    }
   ],
   "source": [
    "from gqlalchemy import Memgraph\n",
    "\n",
    "# Make a connection to the database\n",
    "memgraph = Memgraph(host='127.0.0.1', port=7687)\n",
    "\n",
    "# Delete all nodes and relationships\n",
    "query = \"MATCH (n) DETACH DELETE n\"\n",
    "\n",
    "# Execute the query\n",
    "memgraph.execute(query)\n",
    "\n",
    "# Create a node with the label FirstNode and message property with the value \"Hello, World!\"\n",
    "query = \"\"\"CREATE (n:FirstNode)\n",
    "           SET n.message = '{message}'\n",
    "           RETURN 'Node '  + id(n) + ': ' + n.message AS result\"\"\".format(message=\"Hello, World!\")\n",
    "\n",
    "# Execute the query\n",
    "results = memgraph.execute_and_fetch(query)\n",
    "\n",
    "# Print the first member\n",
    "print(list(results)[0]['result'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fc6534aa",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
